#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/stum0/nostr_mempool_bot/runs/run-vi6bz7wgRf6DtKCZ

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
module.eks.module.frigga.random_pet.name: Refreshing state... [id=commonly-star-wren]
module.eks.module.frigga.random_string.suffix: Refreshing state... [id=eqtpf]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0f7975d3af29fde03]
module.eks.data.aws_region.current: Reading...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-061422c2c784eb3a4]
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_region.current: Read complete after 0s [id=eu-west-2]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.aws_iam_role.cp: Refreshing state... [id=nostr-cp]
module.eks.aws_iam_role.fargate[0]: Refreshing state... [id=nostr-fargate]
module.eks.aws_iam_role_policy_attachment.eks-cluster: Refreshing state... [id=nostr-cp-20221108031352872400000002]
module.eks.aws_iam_role_policy_attachment.eks-fargate[0]: Refreshing state... [id=nostr-fargate-20221108031352813400000001]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-071de8b2f9f8df1ec]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f95190f999eaa7b7]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-048ff33657677a3bf]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f95190f999eaa7b71080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0f95190f999eaa7b7"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-048ff33657677a3bf"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name"                        = "nostr-public"
            "kubernetes.io/cluster/nostr" = "shared"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.aws_eks_cluster_auth.cp will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "cp" {
      + id    = (known after apply)
      + name  = "nostr"
      + token = (sensitive value)
    }

  # module.eks.data.template_file.br will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "br" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            [settings.kubernetes]
            cluster-name = "${cluster_name}"
            api-server = "${cluster_endpoint}"
            cluster-certificate = "${cluster_ca_data}"
            
            [settings.host-containers.admin]
            enabled = ${admin_container_enabled}
            superpowered = ${admin_container_superpowered}
            %{ if admin_container_source != "" }
            source = "${admin_container_source}"
            %{ endif }
            
            [settings.host-containers.control]
            enabled = ${control_container_enabled}
        EOT
      + vars     = {
          + "admin_container_enabled"      = "false"
          + "admin_container_source"       = ""
          + "admin_container_superpowered" = "false"
          + "cluster_ca_data"              = (known after apply)
          + "cluster_endpoint"             = (known after apply)
          + "cluster_name"                 = "nostr"
          + "control_container_enabled"    = "false"
        }
    }

  # module.eks.aws_eks_cluster.cp will be created
  + resource "aws_eks_cluster" "cp" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "nostr"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::493031039834:role/nostr-cp"
      + status                = (known after apply)
      + tags                  = {
          + "env"          = "dev"
          + "terraform.io" = "managed"
        }
      + tags_all              = {
          + "env"          = "dev"
          + "terraform.io" = "managed"
        }
      + version               = "1.21"

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_fargate_profile.fargate["default"] will be created
  + resource "aws_eks_fargate_profile" "fargate" {
      + arn                    = (known after apply)
      + cluster_name           = "nostr"
      + fargate_profile_name   = "default"
      + id                     = (known after apply)
      + pod_execution_role_arn = "arn:aws:iam::493031039834:role/nostr-fargate"
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "env"          = "dev"
          + "terraform.io" = "managed"
        }
      + tags_all               = {
          + "env"          = "dev"
          + "terraform.io" = "managed"
        }

      + selector {
          + namespace = "default"
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc will be created
  + resource "aws_iam_openid_connect_provider" "oidc" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ]
      + url             = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-061422c2c784eb3a4"
      ~ tags                 = {
          ~ "Name"                        = "nostr-eu-west-2" -> "nostr-eu-west-2a"
            # (1 unchanged element hidden)
        }
      ~ tags_all             = {
          ~ "Name"                        = "nostr-eu-west-2" -> "nostr-eu-west-2a"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = "eipalloc-061422c2c784eb3a4"
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"                        = "nostr-eu-west-2a"
          + "kubernetes.io/cluster/nostr" = "shared"
        }
      + tags_all             = {
          + "Name"                        = "nostr-eu-west-2a"
          + "kubernetes.io/cluster/nostr" = "shared"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-071de8b2f9f8df1ec"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-071de8b2f9f8df1ec"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-071de8b2f9f8df1ec"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-071de8b2f9f8df1ec"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-0f95190f999eaa7b7"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-0f95190f999eaa7b7"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-0f95190f999eaa7b7"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                        = "nostr-private-eu-west-2a"
          + "kubernetes.io/cluster/nostr" = "shared"
        }
      + tags_all                                       = {
          + "Name"                        = "nostr-private-eu-west-2a"
          + "kubernetes.io/cluster/nostr" = "shared"
        }
      + vpc_id                                         = "vpc-0f7975d3af29fde03"
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                        = "nostr-private-eu-west-2b"
          + "kubernetes.io/cluster/nostr" = "shared"
        }
      + tags_all                                       = {
          + "Name"                        = "nostr-private-eu-west-2b"
          + "kubernetes.io/cluster/nostr" = "shared"
        }
      + vpc_id                                         = "vpc-0f7975d3af29fde03"
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                        = "nostr-private-eu-west-2c"
          + "kubernetes.io/cluster/nostr" = "shared"
        }
      + tags_all                                       = {
          + "Name"                        = "nostr-private-eu-west-2c"
          + "kubernetes.io/cluster/nostr" = "shared"
        }
      + vpc_id                                         = "vpc-0f7975d3af29fde03"
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                        = "nostr-public-eu-west-2a"
          + "kubernetes.io/cluster/nostr" = "shared"
        }
      + tags_all                                       = {
          + "Name"                        = "nostr-public-eu-west-2a"
          + "kubernetes.io/cluster/nostr" = "shared"
        }
      + vpc_id                                         = "vpc-0f7975d3af29fde03"
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                        = "nostr-public-eu-west-2b"
          + "kubernetes.io/cluster/nostr" = "shared"
        }
      + tags_all                                       = {
          + "Name"                        = "nostr-public-eu-west-2b"
          + "kubernetes.io/cluster/nostr" = "shared"
        }
      + vpc_id                                         = "vpc-0f7975d3af29fde03"
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                        = "nostr-public-eu-west-2c"
          + "kubernetes.io/cluster/nostr" = "shared"
        }
      + tags_all                                       = {
          + "Name"                        = "nostr-public-eu-west-2c"
          + "kubernetes.io/cluster/nostr" = "shared"
        }
      + vpc_id                                         = "vpc-0f7975d3af29fde03"
    }

Plan: 17 to add, 1 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-vi6bz7wgRf6DtKCZ/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-vi6bz7wgRf6DtKCZ/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pushed by: @stum0, Action: `pull_request`*